tutorials/CFD/DEIM/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CAD.obj
{
    extractionMethod     extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle    150;
    }

    subsetFeatures
    {
        nonManifoldEdges yes;
        openEdges        yes;
    }

    writeObj             yes;
}

// ************************************************************************* //
